In [28]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Object Creation

In [29]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [30]:
dates = pd.date_range('20130101', periods=6)

In [31]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [32]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.128430 -0.056997  0.549937  0.401965
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719
2013-01-03  1.963546  0.138829 -1.268223 -1.042067
2013-01-04 -0.473869 -1.004100 -1.283539  0.489804
2013-01-05 -0.190413 -0.107991 -0.413620 -1.209322
2013-01-06 -0.666174 -1.544537 -1.678206  0.476576

In [33]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [34]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [35]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Viewing Data

In [36]:
df.head()

                   A         B         C         D
2013-01-01  1.128430 -0.056997  0.549937  0.401965
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719
2013-01-03  1.963546  0.138829 -1.268223 -1.042067
2013-01-04 -0.473869 -1.004100 -1.283539  0.489804
2013-01-05 -0.190413 -0.107991 -0.413620 -1.209322

In [37]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.473869 -1.004100 -1.283539  0.489804
2013-01-05 -0.190413 -0.107991 -0.413620 -1.209322
2013-01-06 -0.666174 -1.544537 -1.678206  0.476576

In [38]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.473869 -1.004100 -1.283539  0.489804
2013-01-05 -0.190413 -0.107991 -0.413620 -1.209322
2013-01-06 -0.666174 -1.544537 -1.678206  0.476576

In [39]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [40]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [41]:
df.values

array([[ 1.1284297 , -0.0569974 ,  0.54993703,  0.40196488],
       [ 1.10573086, -0.13318144, -0.096573  , -0.31771892],
       [ 1.963546  ,  0.13882874, -1.26822269, -1.04206708],
       [-0.47386852, -1.00410014, -1.28353914,  0.48980433],
       [-0.1904125 , -0.10799128, -0.41362027, -1.20932171],
       [-0.66617446, -1.54453708, -1.67820611,  0.47657626]])

In [42]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.477875 -0.451330 -0.698371 -0.200127
std    1.066388  0.666865  0.851909  0.779437
min   -0.666174 -1.544537 -1.678206 -1.209322
25%   -0.403005 -0.786370 -1.279710 -0.860980
50%    0.457659 -0.120586 -0.840921  0.042123
75%    1.122755 -0.069746 -0.175835  0.457923
max    1.963546  0.138829  0.549937  0.489804

In [43]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.128430    1.105731    1.963546   -0.473869   -0.190413   -0.666174
B   -0.056997   -0.133181    0.138829   -1.004100   -0.107991   -1.544537
C    0.549937   -0.096573   -1.268223   -1.283539   -0.413620   -1.678206
D    0.401965   -0.317719   -1.042067    0.489804   -1.209322    0.476576

In [44]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.401965  0.549937 -0.056997  1.128430
2013-01-02 -0.317719 -0.096573 -0.133181  1.105731
2013-01-03 -1.042067 -1.268223  0.138829  1.963546
2013-01-04  0.489804 -1.283539 -1.004100 -0.473869
2013-01-05 -1.209322 -0.413620 -0.107991 -0.190413
2013-01-06  0.476576 -1.678206 -1.544537 -0.666174

In [45]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.666174 -1.544537 -1.678206  0.476576
2013-01-04 -0.473869 -1.004100 -1.283539  0.489804
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719
2013-01-05 -0.190413 -0.107991 -0.413620 -1.209322
2013-01-01  1.128430 -0.056997  0.549937  0.401965
2013-01-03  1.963546  0.138829 -1.268223 -1.042067

Selection

Getting

In [46]:
df['A']

2013-01-01    1.128430
2013-01-02    1.105731
2013-01-03    1.963546
2013-01-04   -0.473869
2013-01-05   -0.190413
2013-01-06   -0.666174
Freq: D, Name: A, dtype: float64

In [47]:
df[0:3]

                   A         B         C         D
2013-01-01  1.128430 -0.056997  0.549937  0.401965
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719
2013-01-03  1.963546  0.138829 -1.268223 -1.042067

In [48]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719
2013-01-03  1.963546  0.138829 -1.268223 -1.042067
2013-01-04 -0.473869 -1.004100 -1.283539  0.489804

Selection by Label

In [49]:
df.loc[dates[0]]

A    1.128430
B   -0.056997
C    0.549937
D    0.401965
Name: 2013-01-01 00:00:00, dtype: float64

In [50]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.128430 -0.056997
2013-01-02  1.105731 -0.133181
2013-01-03  1.963546  0.138829
2013-01-04 -0.473869 -1.004100
2013-01-05 -0.190413 -0.107991
2013-01-06 -0.666174 -1.544537

In [51]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.105731 -0.133181
2013-01-03  1.963546  0.138829
2013-01-04 -0.473869 -1.004100

In [52]:
df.loc['20130102',['A','B']]

A    1.105731
B   -0.133181
Name: 2013-01-02 00:00:00, dtype: float64

In [53]:
df.loc[dates[0],'A']

1.128429696159145

In [54]:
df.at[dates[0],'A']

1.128429696159145

Selection by Position

In [55]:
df.iloc[3]

A   -0.473869
B   -1.004100
C   -1.283539
D    0.489804
Name: 2013-01-04 00:00:00, dtype: float64

In [56]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.473869 -1.004100
2013-01-05 -0.190413 -0.107991

In [57]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.105731 -0.096573
2013-01-03  1.963546 -1.268223
2013-01-05 -0.190413 -0.413620

In [58]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719
2013-01-03  1.963546  0.138829 -1.268223 -1.042067

In [59]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.056997  0.549937
2013-01-02 -0.133181 -0.096573
2013-01-03  0.138829 -1.268223
2013-01-04 -1.004100 -1.283539
2013-01-05 -0.107991 -0.413620
2013-01-06 -1.544537 -1.678206

In [60]:
df.iloc[1,1]

-0.1331814358966924

In [61]:
df.iat[1,1]

-0.1331814358966924

Boolean Indexing

In [62]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.128430 -0.056997  0.549937  0.401965
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719
2013-01-03  1.963546  0.138829 -1.268223 -1.042067

In [63]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.128430       NaN  0.549937  0.401965
2013-01-02  1.105731       NaN       NaN       NaN
2013-01-03  1.963546  0.138829       NaN       NaN
2013-01-04       NaN       NaN       NaN  0.489804
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06       NaN       NaN       NaN  0.476576

In [64]:
df2 = df.copy()

In [65]:
df2['E'] = ['one', 'one','two','three','four','three']

In [66]:
df2

                   A         B         C         D      E
2013-01-01  1.128430 -0.056997  0.549937  0.401965    one
2013-01-02  1.105731 -0.133181 -0.096573 -0.317719    one
2013-01-03  1.963546  0.138829 -1.268223 -1.042067    two
2013-01-04 -0.473869 -1.004100 -1.283539  0.489804  three
2013-01-05 -0.190413 -0.107991 -0.413620 -1.209322   four
2013-01-06 -0.666174 -1.544537 -1.678206  0.476576  three

In [67]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.963546  0.138829 -1.268223 -1.042067   two
2013-01-05 -0.190413 -0.107991 -0.413620 -1.209322  four

Setting

In [68]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [69]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [70]:
df['F'] = s1

In [71]:
df.at[dates[0],'A'] = 0

In [72]:
df.iat[0,1] = 0

In [73]:
df.loc[:,'D'] = np.array([5] * len(df))

In [74]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.549937  5  NaN
2013-01-02  1.105731 -0.133181 -0.096573  5  1.0
2013-01-03  1.963546  0.138829 -1.268223  5  2.0
2013-01-04 -0.473869 -1.004100 -1.283539  5  3.0
2013-01-05 -0.190413 -0.107991 -0.413620  5  4.0
2013-01-06 -0.666174 -1.544537 -1.678206  5  5.0

In [75]:
df2 = df.copy()

In [76]:
df2[df2 > 0] = -df2

In [77]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.549937 -5  NaN
2013-01-02 -1.105731 -0.133181 -0.096573 -5 -1.0
2013-01-03 -1.963546 -0.138829 -1.268223 -5 -2.0
2013-01-04 -0.473869 -1.004100 -1.283539 -5 -3.0
2013-01-05 -0.190413 -0.107991 -0.413620 -5 -4.0
2013-01-06 -0.666174 -1.544537 -1.678206 -5 -5.0

In [78]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [79]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [80]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.549937  5  NaN  1.0
2013-01-02  1.105731 -0.133181 -0.096573  5  1.0  1.0
2013-01-03  1.963546  0.138829 -1.268223  5  2.0  NaN
2013-01-04 -0.473869 -1.004100 -1.283539  5  3.0  NaN

In [81]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.105731 -0.133181 -0.096573  5  1.0  1.0

In [82]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.549937  5  5.0  1.0
2013-01-02  1.105731 -0.133181 -0.096573  5  1.0  1.0
2013-01-03  1.963546  0.138829 -1.268223  5  2.0  5.0
2013-01-04 -0.473869 -1.004100 -1.283539  5  3.0  5.0

In [83]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

Operations

Stats

In [84]:
df.mean()

A    0.289804
B   -0.441830
C   -0.698371
D    5.000000
F    3.000000
dtype: float64

In [85]:
df.mean(1)

2013-01-01    1.387484
2013-01-02    1.375195
2013-01-03    1.566830
2013-01-04    1.047698
2013-01-05    1.657595
2013-01-06    1.222216
Freq: D, dtype: float64

In [86]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [87]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [88]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.963546 -0.861171 -2.268223  4.0  1.0
2013-01-04 -3.473869 -4.004100 -4.283539  2.0  0.0
2013-01-05 -5.190413 -5.107991 -5.413620  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

Apply

In [89]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.549937   5   NaN
2013-01-02  1.105731 -0.133181  0.453364  10   1.0
2013-01-03  3.069277  0.005647 -0.814859  15   3.0
2013-01-04  2.595408 -0.998453 -2.098398  20   6.0
2013-01-05  2.404996 -1.106444 -2.512018  25  10.0
2013-01-06  1.738821 -2.650981 -4.190224  30  15.0

In [90]:
df.apply(lambda x: x.max() - x.min())

A    2.629720
B    1.683366
C    2.228143
D    0.000000
F    4.000000
dtype: float64

In [91]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [92]:
s

0    4
1    5
2    6
3    6
4    2
5    3
6    6
7    0
8    4
9    4
dtype: int32

In [93]:
s.value_counts()

4    3
6    3
5    1
2    1
3    1
0    1
dtype: int64

String Methods

In [94]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [95]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

Merge

Concat

In [96]:
df = pd.DataFrame(np.random.randn(10, 4))

In [97]:
df

          0         1         2         3
0  0.393848 -1.473009  1.198175  0.866073
1 -0.170240 -1.544356  1.059334 -0.197935
2 -1.662401 -0.119283  0.552898  0.881808
3 -1.353555  0.842478 -0.642038  0.218233
4  0.575130  1.413803 -1.025752  0.764950
5 -1.610839 -1.792277  0.231713  2.236963
6 -1.153134 -0.446035 -0.003046  1.423317
7 -2.709717  0.438984  0.456123  1.042525
8  0.260812 -0.225783 -0.546969  1.258114
9 -1.734752 -2.200343  0.538115  1.158243

In [98]:
pieces = [df[:3], df[3:7], df[7:]]

In [99]:
pd.concat(pieces)

          0         1         2         3
0  0.393848 -1.473009  1.198175  0.866073
1 -0.170240 -1.544356  1.059334 -0.197935
2 -1.662401 -0.119283  0.552898  0.881808
3 -1.353555  0.842478 -0.642038  0.218233
4  0.575130  1.413803 -1.025752  0.764950
5 -1.610839 -1.792277  0.231713  2.236963
6 -1.153134 -0.446035 -0.003046  1.423317
7 -2.709717  0.438984  0.456123  1.042525
8  0.260812 -0.225783 -0.546969  1.258114
9 -1.734752 -2.200343  0.538115  1.158243

Join

In [100]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [101]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [102]:
left

   key  lval
0  foo     1
1  foo     2

In [103]:
right

   key  rval
0  foo     4
1  foo     5

In [104]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [105]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [106]:
df

          A         B         C         D
0  1.753345 -0.954140 -2.112622  1.884761
1  1.098647 -0.461266  0.030942 -0.377921
2 -1.175286 -0.357136  0.255899 -0.172446
3 -2.131897  0.990723 -1.135326  1.225849
4  2.073966 -0.104267  0.264594 -0.098841
5  2.482848  0.442764 -0.104855 -0.156999
6 -0.210089  1.440383  0.808566 -2.689528
7  0.511487 -0.161331 -0.159605 -0.378116

In [107]:
s = df.iloc[3]

In [108]:
df.append(s, ignore_index=True)

C:\Users\Caíque Miranda\AppData\Local\Temp\ipykernel_8032\4011806271.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(s, ignore_index=True)

          A         B         C         D
0  1.753345 -0.954140 -2.112622  1.884761
1  1.098647 -0.461266  0.030942 -0.377921
2 -1.175286 -0.357136  0.255899 -0.172446
3 -2.131897  0.990723 -1.135326  1.225849
4  2.073966 -0.104267  0.264594 -0.098841
5  2.482848  0.442764 -0.104855 -0.156999
6 -0.210089  1.440383  0.808566 -2.689528
7  0.511487 -0.161331 -0.159605 -0.378116
8 -2.131897  0.990723 -1.135326  1.225849

Grouping

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
....: 'foo', 'bar', 'foo', 'foo'],
....: 'B' : ['one', 'one', 'two', 'three',
....: 'two', 'two', 'one', 'three'],
....: 'C' : np.random.randn(8),
....: 'D' : np.random.randn(8)})

In [ ]:
df

In [ ]:
df.groupby('A').sum()

In [ ]:
df.groupby(['A','B']).sum()

Reshaping

In [ ]:
In [90]: tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
....: 'foo', 'foo', 'qux', 'qux'],
....: ['one', 'two', 'one', 'two',
....: 'one', 'two', 'one', 'two']]))

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [ ]:
df2 = df[:4]

In [ ]:
df2

In [ ]:
stacked = df2.stack()

In [ ]:
stacked

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(0)

Pivot Tables

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
.....: 'B' : ['A', 'B', 'C'] * 4,
.....: 'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2
.....: 'D' : np.random.randn(12),
.....: 'E' : np.random.randn(12)})

In [ ]:
df

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

Time Series

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [ ]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [ ]:
ts.resample('5Min', how='sum')

In [ ]:
106]: rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [ ]:
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')

In [ ]:
ts_utc

In [ ]:
ts_utc.tz_convert('US/Eastern')

In [ ]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [ ]:
ts

In [ ]:
ps = ts.to_period()

In [ ]:
ps

In [ ]:
ps.to_timestamp()

In [ ]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [ ]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [ ]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [ ]:
ts.head()

Categoricals

In [ ]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a',

In [ ]:
df["grade"] = df["raw_grade"].astype("category")

In [ ]:
df["grade"]

In [ ]:
125]: df["grade"].cat.categories = ["very good", "good", "very bad"]

In [ ]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium

In [ ]:
df["grade"]

In [ ]:
df.sort_values(by="grade")

In [ ]:
df.groupby("grade").size()

Plotting